Repository: Jonlandu/projection_citations
Catalog: lib/l10n/app_*.arb
Languages: fr, pt

# welcomeTitle
source: Welcome
fr: Bienvenue
pt: Bem-vindo

# welcomeSubtitle
source: Offline application for intelligent text refactoring and formatting.
fr: Application hors ligne de refactorisation et mise en forme intelligente de texte.
pt: Aplicação offline para refatoração e formatação inteligente de textos.

# welcomeBullets
source: • Paste a raw text • Configure the splitting (words / characters) • Generate a clean and structured text • Copy without mandatory saving
fr: • Colle un texte brut • Configure le découpage (mots / caractères) • Génère un texte propre et structuré • Copie sans obligation d’enregistrement
pt: • Cole um texto bruto • Configure o recorte (palavras / caracteres) • Gere um texto limpo e estruturado • Copie sem obrigação de salvar

# start
source: Get started
fr: Commencer
pt: Começar

source: Language
fr: Langue
pt: Idioma

source: System language
fr: Langue du système
pt: Idioma do sistema

source: French
fr: Français
pt: Francês

source: English
pt: Inglês

source: Portuguese
fr: Português
pt: Português

# helpTitle
source: Help
fr: Aide
pt: Ajuda

# helpHeader
source: Help & Guide
fr: Aide & Guide
pt: Ajuda & Guia

# helpBody
source: 1) Paste your raw text into the 'Raw text' area. 2) Configure the settings (words, characters, separator, punctuation, numbering). 3) Click on 'Refactor' (or Ctrl + Enter). 4) You can edit the generated text. 5) Click on 'Copy result' to copy. Tips: - To keep existing paragraphs: set the limit to 'None'. - To create balanced paragraphs: use 'Word count' (e.g. 60–120). - The separator accepts \n for line breaks (e.g. \n\n).
fr: 1) Colle ton texte brut dans la zone 'Texte brut'. 2) Configure les paramètres (mots, caractères, séparateur, ponctuation, numérotation). 3) Clique sur 'Refactoriser' (ou Ctrl + Entrée). 4) Tu peux modifier le texte généré. 5) Clique sur 'Copier résultat' pour copier. Conseils: - Si tu veux garder les paragraphes existants : mets 'Aucune' dans la limite. - Pour créer des paragraphes équilibrés : utilise 'Nombre de mots' (ex: 60–120). - Le séparateur accepte \n pour retour ligne (ex: \n\n).
pt: 1) Cole o texto bruto na área 'Texto bruto'. 2) Configure os parâmetros (palavras, caracteres, separador, pontuação, numeração). 3) Clique em 'Refatorar' (ou Ctrl + Enter). 4) Você pode editar o texto gerado. 5) Clique em 'Copiar resultado' para copiar. Dicas: - Para manter os parágrafos existentes: selecione 'Nenhum' no limite. - Para criar parágrafos equilibrados: use 'Número de palavras' (ex: 60–120). - O separador aceita \n para quebra de linha (ex: \n\n).

# helpNumberingExamplesTitle
source: Numbering format examples
fr: Exemples de format de numérotation
pt: Exemplos de formato de numeração

# historyTitle
source: History
fr: Historique
pt: Histórico

# historyEmpty
source: No history yet.
fr: Aucun historique pour le moment.
pt: Nenhum histórico por enquanto.

source: Delete all
fr: Tout supprimer
pt: Apagar tudo

source: History cleared
fr: Historique supprimé
pt: Histórico apagado

source: Entry deleted
fr: Entrée supprimée
pt: Entrada apagada

source: UNDO
fr: ANNULER
pt: DESFAZER

source: Delete
fr: Supprimer
pt: Apagar

# historyItemSubtitle
source: On {date} • {count} chars
fr: Le {date} • {count} chars
pt: Em {date} • {count} caracteres

# settingsTitle
source: Settings
fr: Paramètres
pt: Configurações

# presetCitation
source: Citation Preset
fr: Preset Citation
pt: Preset de Citação

# chunkLimitTitle
source: Split limit (paragraphs)
fr: Limite de découpage (paragraphes)
pt: Limite de recorte (parágrafos)

# limitNone
source: None (keep existing paragraphs)
fr: Aucune (respecter les paragraphes)
pt: Nenhum (manter parágrafos existentes)

# limitWords
source: Word count
fr: Nombre de mots
pt: Número de palavras

# limitChars
source: Character count
fr: Nombre de caractères
pt: Número de caracteres

# maxWordsLabel
source: Max words per paragraph (e.g. 90)
fr: Max mots par paragraphe (ex: 90)
pt: Máx. palavras por parágrafo (ex: 90)

# maxCharsLabel
source: Max characters per paragraph (e.g. 650)
fr: Max caractères par paragraphe (ex: 650)
pt: Máx. caracteres por parágrafo (ex: 650)

# chunkTip
source: Tip: enable smart mode if sentences are very long.
fr: Astuce: active le mode intelligent si les phrases sont très longues.
pt: Dica: ative o modo inteligente se as frases forem muito longas.

# smartRefactorTitle
source: Smart refactoring
fr: Refactorisation intelligente
pt: Refatoração inteligente

# modeLabel
source: Mode
pt: Modo

# modeSoft
source: Soft (natural style)
fr: Doux (style naturel)
pt: Suave (estilo natural)

# modeStrict
source: Strict (more structured)
fr: Strict (plus structuré)
pt: Rigoroso (mais estruturado)

# modeAggressive
source: Aggressive (splits more)
fr: Agressif (coupe davantage)
pt: Agressivo (recorta mais)

# smartSplitTitle
source: Smartly split long thoughts
fr: Découper les pensées longues intelligemment
pt: Recortar pensamentos longos de forma inteligente

# smartSplitSubtitle
source: Sentence → ; : , → words (fallback)
fr: Phrase → ; : , → mots (fallback)
pt: Frase → ; : , → palavras (fallback)

# separatorTitle
source: Paragraph / strophe separator
fr: Séparateur de paragraphe / strophe
pt: Separador de parágrafo / estrofe

# separatorHint
source: e.g. \n\n or ----
fr: Ex: \n\n ou ----
pt: Ex: \n\n ou ----

# ensurePunctTitle
source: Ensure punctuation at the end of each block
fr: Assurer ponctuation en fin de bloc
pt: Garantir pontuação no fim do bloco

# strophesTitle
source: Strophes & lines (like your example)
fr: Strophes & lignes (comme ton exemple)
pt: Estrofes & linhas (como no seu exemplo)

# outputFormatLabel
source: Final format
fr: Format final
pt: Formato final

# formatParagraph
source: Classic paragraphs
fr: Paragraphes classiques
pt: Parágrafos clássicos

# formatStropheLines
source: Strophes (lines)
fr: Strophes (lignes)
pt: Estrofes (linhas)

# autoLineWidthTitle
source: Auto: line width based on window
fr: Auto: largeur de ligne selon la fenêtre
pt: Auto: largura da linha conforme a janela

# autoLineWidthSubtitle
source: Measures the result area and adjusts chars/line
fr: Mesure la zone résultat et ajuste chars/ligne
pt: Mede a área do resultado e ajusta chars/linha

# linesPerStropheLabel
source: Lines per strophe (e.g. 4)
fr: Lignes / strophe (ex: 4)
pt: Linhas por estrofe (ex: 4)

# charsPerLineLabel
source: Line width (chars)
fr: Largeur ligne (chars)
pt: Largura da linha (chars)

# longWordsLabel
source: Very long words
fr: Mots très longs
pt: Palavras muito longas

# longWordHyphen
source: Long word: split with '-'
fr: Mot long: découper avec '-'
pt: Palavra longa: dividir com '-'

# longWordHard
source: Long word: split without '-'
fr: Mot long: découper sans '-'
pt: Palavra longa: dividir sem '-'

# longWordOverflow
source: Long word: do not split (overflow)
fr: Mot long: ne pas couper (overflow)
pt: Palavra longa: não dividir (overflow)

# preserveHeadersTitle
source: Preserve headers (*...*, §..., dates…)
fr: Préserver les titres (*...*, §..., dates…)
pt: Preservar títulos (*...*, §..., datas…)

# smartStrophesTitle
source: Smart strophes (end of sentence)
fr: Strophes intelligentes (fin de phrase)
pt: Estrofes inteligentes (fim da frase)

# smartStrophesSubtitle
source: Prefer ending a strophe on a complete sentence when possible
fr: Ferme une strophe sur une phrase complète quand c’est pertinent
pt: Prefere fechar a estrofe numa frase completa quando possível

# numberingTitle
source: Automatic numbering
fr: Numérotation automatique
pt: Numeração automática

# numberingFormatLabel
source: Format (e.g. 1) | 1. | [1] )
fr: Format (ex: 1) | 1. | [1] )
pt: Formato (ex: 1) | 1. | [1] )

# shortcutsTitle
source: Shortcuts:
fr: Raccourcis :
pt: Atalhos:

# shortcutProcess
source: • Ctrl + Enter: Refactor
fr: • Ctrl + Entrée : Refactoriser
pt: • Ctrl + Enter: Refatorar

# shortcutInsertSep
source: • Ctrl + Shift + Enter: Insert separator
fr: • Ctrl + Shift + Entrée : Insérer séparateur
pt: • Ctrl + Shift + Enter: Inserir separador

# shortcutPreset
source: • Ctrl + Alt + B: Citation Preset
fr: • Ctrl + Alt + B : Preset Citation
pt: • Ctrl + Alt + B: Preset de Citação

source: Reset
fr: Réinitialiser
pt: Reiniciar

source: Processing...
fr: Traitement...
pt: Processando...

source: Refactor
fr: Refactoriser
pt: Refatorar

source: Insert separator
fr: Insérer séparateur
pt: Inserir separador

source: Copy result
fr: Copier résultat
pt: Copiar resultado

# copied
source: Text copied!
fr: Texte copié !
pt: Texto copiado!

# rawTextTitle
source: Raw text
fr: Texte brut
pt: Texto bruto

# generatedTextTitle
source: Generated text
fr: Texte généré
pt: Texto gerado

# rawHint
source: Paste your text here… (double Enter = separator)
fr: Colle ton texte ici… (double Entrée = séparateur)
pt: Cole seu texto aqui… (duplo Enter = separador)

# generatedHint
source: Result will appear here… (editable)
fr: Le résultat apparaîtra ici… (modifiable)
pt: O resultado aparecerá aqui… (editável)

# stats
source: Input: {inChars} chars • Output: {outChars} chars
fr: Entrée: {inChars} chars • Sortie: {outChars} chars
pt: Entrada: {inChars} chars • Saída: {outChars} chars

# editorTitle
source: Editor
fr: Éditeur
